andersenthomas98/masteroppgave/nrf5sdk_thread/examples/zigbee/experimental/multi_sensor_freertos/main.c
    /* Get new temperature measured value */
    new_temp_value = (zb_int16_t)sensorsim_measure(&m_temperature_sim_state, &m_temperature_sim_cfg);

    /* Warning: According to https://freertos.org/RTOS-software-timer.html timer callback shall never attempt to block.
     * But call to zb_zcl_set_attr_val must be guarded by mutex OR must happen from zigbee_main_task context (no guarding required)
     * One method to solve the problem is to schedule a callback to zboss scheduler.
     * ZBOSS API callback types zb_callback_t and zb_callback2_t are unfortunately limited, in particular they don't allow
     * to pass opaque pointer to callback. That's why we pass data via global context here.
     */
    vTaskSuspendAll();
    m_update_temperature_measurement_ctx.measured_value = new_temp_value;
    UNUSED_RETURN_VALUE(xTaskResumeAll());

    zb_ret_t zb_ret;

    /* Note: ZB_SCHEDULE_APP_CALLBACK is thread safe by exception, conversely to most ZBOSS API */
    zb_ret = ZB_SCHEDULE_APP_CALLBACK(update_temperature_measurement_cb, 0U);
    if (zb_ret != RET_OK)
    {
        NRF_LOG_ERROR("Temperature sample lost.");
    }
}

/**@brief  Task performing pressure measurement.
 *
 * @note What this task does could be done from @ref temperature_measurement_timer_handler.
 * This is just to show different methods of updating attributes outgoing from zigbee stack.
 *
 * @param pvParam  Not used, required by freertos api
 */
static void pressure_measurement_task(void *pvParam)
{
    /* Just to show that we are NOT in zigbee_main_task context */
    ASSERT(xTaskGetCurrentTaskHandle() != m_zigbee_main_task_handle);

    NRF_LOG_INFO("The pressure_measurement_task started.");

    TickType_t  last_update_wake_timestamp;
    last_update_wake_timestamp = xTaskGetTickCount();

    while (true)
    {
        zb_zcl_status_t zcl_status;
        zb_int16_t      new_pres_value;

        /* Get new pressure measured value */
        new_pres_value = (zb_int16_t)sensorsim_measure(&m_pressure_sim_state, &m_pressure_sim_cfg);

        if (xSemaphoreTakeRecursive(m_zigbee_main_task_mutex, 1000U) == pdTRUE)
        {
            /* Set new pressure value as zcl attribute
             * NOTE this is not thread-safe and locking is required
             */
            zcl_status = zb_zcl_set_attr_val(MULTI_SENSOR_ENDPOINT,
                                             ZB_ZCL_CLUSTER_ID_PRESSURE_MEASUREMENT,
                                             ZB_ZCL_CLUSTER_SERVER_ROLE,
                                             ZB_ZCL_ATTR_PRES_MEASUREMENT_VALUE_ID,
                                             (zb_uint8_t *)&new_pres_value,
                                             ZB_FALSE);
            UNUSED_RETURN_VALUE(xSemaphoreGiveRecursive(m_zigbee_main_task_mutex));

            if (zcl_status != ZB_ZCL_STATUS_SUCCESS)
            {
                NRF_LOG_INFO("Set pressure value fail. zcl_status: %d", zcl_status);
            }
        }
        else
        {
            NRF_LOG_ERROR("Unable to take zigbee_task_mutex from pressure_measurement_task");
        }

        /* Let the task sleep for some time, consider it as pressure sample period  */
        vTaskDelayUntil(&last_update_wake_timestamp, pdMS_TO_TICKS(1000U));
    }
}


/**@brief Zigbee stack event handler.
 *
 * @param[in] bufid     Reference to the Zigbee stack buffer used to pass signal.
 */
void zboss_signal_handler(zb_bufid_t bufid)
{
    /* Just to show that we are in zigbee_main_task context */
    ASSERT(xTaskGetCurrentTaskHandle() == m_zigbee_main_task_handle);

    zb_zdo_app_signal_hdr_t  * p_sg_p      = NULL;
    zb_zdo_app_signal_type_t   sig         = zb_get_app_signal(bufid, &p_sg_p);
    zb_ret_t                   status      = ZB_GET_APP_SIGNAL_STATUS(bufid);

    /* Update network status LED */
    zigbee_led_status_update(bufid, ZIGBEE_NETWORK_STATE_LED);

    switch (sig)
    {
        case ZB_BDB_SIGNAL_DEVICE_REBOOT:
            /* fall-through */
        case ZB_BDB_SIGNAL_STEERING:
            /* Call default signal handler. */
            ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
            if (status == RET_OK)
            {
                ret_code_t err_code = app_timer_start(temperature_measurement_timer, APP_TIMER_TICKS(1000), NULL);
                APP_ERROR_CHECK(err_code);
            }
            break;

        case ZB_COMMON_SIGNAL_CAN_SLEEP:
            /* When freertos is used zb_sleep_now must not be used, due to
             * zigbee communication being not the only task to be performed by node.
             */
            break;

        default:
            /* Call default signal handler. */
            ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
            break;
    }

    if (bufid)
    {
        zb_buf_free(bufid);
    }
}


void zigbee_main_task(void *pvParameter)
{
    zb_ret_t       zb_err_code;

    UNUSED_PARAMETER(pvParameter);

    NRF_LOG_INFO("The zigbee_main_task started.");

    /* Start Zigbee Stack. */
    zb_err_code = zboss_start_no_autostart();
    ZB_ERROR_CHECK(zb_err_code);

    while (true)
    {
        if (xSemaphoreTakeRecursive(m_zigbee_main_task_mutex, 5) == pdTRUE)
        {
            zboss_main_loop_iteration();
            UNUSED_RETURN_VALUE(xSemaphoreGiveRecursive(m_zigbee_main_task_mutex));
        }
        vTaskDelay(1);
    }
}


/**@brief  Task function responsible for led blinking
 *
 * @note   This simple functionality could be achieved in other ways with less resources (e.g. by using timers).
 *         Here it shows just the device has some other activity to perform, not related to zigbee itself
 *
 * @param  pvParameter     FreeRTOS task parameter, unused here, required by FreeRTOS API.
 */
static void led_toggle_task(void *pvParameter)
{
    UNUSED_PARAMETER(pvParameter);

    NRF_LOG_INFO("The led_toggle_task started.");

    TickType_t last_led_invert_timestamp;

    last_led_invert_timestamp = xTaskGetTickCount();

    while (true)
    {
        bsp_board_led_invert(BLINKY_LED);
        vTaskDelayUntil(&last_led_invert_timestamp, 200U);
    }
}


