andersenthomas98/masteroppgave/nrf5sdk_thread/examples/zigbee/experimental/multi_sensor_freertos/main.c
#if (NRF_LOG_ENABLED && NRF_LOG_DEFERRED)
/**@brief Task function responsible for deferred log processing.
 *
 * @note It must be running on lower priority than any task generating logs.
 *
 * @param pvParameter     FreeRTOS task parameter, unused here, required by FreeRTOS API.
 */
static void logger_task(void *pvParameter)
{
    UNUSED_PARAMETER(pvParameter);

    while (true)
    {
        if (!(NRF_LOG_PROCESS()))
        {
            /* No more logs, let's sleep and wait for any */
            vTaskDelay(1);
        }
    }
}
#endif

/**@brief FreeRTOS hook function called from idle task */
void vApplicationIdleHook(void)
{
    /* No task is running, just idle on lowest priority, so we can lower power usage */
    __WFE();
}

/**@brief  FreeRTOS hook function called when stack overflow has been detected
 * @note   See FreeRTOS API
 */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
    NRF_LOG_ERROR("vApplicationStackOverflowHook(%x,\"%s\")", xTask, pcTaskName);
    APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
}

/**@brief Function which tries to sleep down the MCU
 *
 * @details This function is called from @ref zboss_main_loop_iteration, when there is no more
 * messages to process. Because @ref zigbee_main_task is not the only one, implementation found
 * in zb_nrf52840_common.c is not appropriate.
 *
 * @note    This function overrides implementation found in zb_nrf52840_common.c
 */
zb_void_t zb_osif_go_idle(zb_void_t)
{
    /* Intentionally empty implementation */
}

/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t     err_code;
    zb_ieee_addr_t ieee_addr;

    /* Initialize logging system and GPIOs. */
    log_init();
    NRF_LOG_INFO("Application start");
    NRF_LOG_FLUSH();

    clock_init();
    timers_init();
    sensor_simulator_init();
    leds_init();

    /* Set Zigbee stack logging level and traffic dump subsystem. */
    ZB_SET_TRACE_LEVEL(ZIGBEE_TRACE_LEVEL);
    ZB_SET_TRACE_MASK(ZIGBEE_TRACE_MASK);
    ZB_SET_TRAF_DUMP_OFF();

    /* Initialize Zigbee stack. */
    ZB_INIT("multi_sensor");

    /* Set device address to the value read from FICR registers. */
    zb_osif_get_ieee_eui64(ieee_addr);
    zb_set_long_address(ieee_addr);

    /* Set static long IEEE address. */
    zb_set_network_ed_role(IEEE_CHANNEL_MASK);
    zigbee_erase_persistent_storage(ERASE_PERSISTENT_CONFIG);

    zb_set_ed_timeout(ED_AGING_TIMEOUT_64MIN);
    zb_set_keepalive_timeout(ZB_MILLISECONDS_TO_BEACON_INTERVAL(3000));
    zb_set_rx_on_when_idle(ZB_FALSE);

    /* Initialize application context structure. */
    UNUSED_RETURN_VALUE(ZB_MEMSET(&m_dev_ctx, 0, sizeof(m_dev_ctx)));

    /* Register temperature sensor device context (endpoints). */
    ZB_AF_REGISTER_DEVICE_CTX(&multi_sensor_ctx);

    /* Initialize sensor device attibutes */
    multi_sensor_clusters_attr_init();

    BaseType_t rtos_result;
#if (NRF_LOG_ENABLED && NRF_LOG_DEFERRED)
    rtos_result = xTaskCreate(logger_task, "LOG", LOG_TASK_STACK_SIZE,
            NULL, LOG_TASK_PRIORITY, &m_logger_task_handle);
    if (rtos_result != pdTRUE)
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif

    /* Create task for LED0 blinking with priority set to 2 */
    rtos_result = xTaskCreate(led_toggle_task, "LED", LED_TOGGLE_TASK_STACK_SIZE,
            NULL, LED_TOGGLE_TASK_PRIORITY, &m_led_toggle_task_handle);
    if (rtos_result != pdPASS)
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    rtos_result = xTaskCreate(pressure_measurement_task, "PM", PRESSURE_MEASUREMENT_TASK_STACK_SIZE,
            NULL, PRESSURE_MEASUREMENT_TASK_PRIORITY, &m_pressure_measurement_task_handle);
    if (rtos_result != pdPASS)
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    /* Create Timer for reporting attribute */
    err_code = app_timer_create(&temperature_measurement_timer, APP_TIMER_MODE_REPEATED,
            temperature_measurement_timer_handler);
    APP_ERROR_CHECK(err_code);

    m_zigbee_main_task_mutex = xSemaphoreCreateRecursiveMutex();
    if (m_zigbee_main_task_mutex == NULL)
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    /* Create task where zboss_main_loop_iteration will be called from */
    rtos_result = xTaskCreate(zigbee_main_task, "ZB", ZIGBEE_MAIN_TASK_STACK_SIZE,
            NULL, ZIGBEE_MAIN_TASK_PRIORITY, &m_zigbee_main_task_handle);
    if (rtos_result != pdPASS)
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    /* Start FreeRTOS scheduler. */
    NRF_LOG_INFO("Starting FreeRTOS scheduler");
    NRF_LOG_FLUSH();
    vTaskStartScheduler();

    while (true)
    {
        /* FreeRTOS should not be here... FreeRTOS goes back to the start of stack
         * in vTaskStartScheduler function. */
    }
}


/**
 * @}
 */
